#encoding:UTF-8
__author__ = 'DDD'



# # -----------------------T1-----------------------------
# print("Hello,World!")



# # -----------------------T2-----------------------------
print("--------------------------鸡兔同笼---------------------------")
tou_1 = input("请输入头的个数：")
print("头的个数：", tou_1)                      # 头的个数
tou = int(tou_1)
jiao_1 = input("请输入脚的个数：")
print("脚的个数：", jiao_1)                     # 脚的个数
jiao = int(jiao_1)
for x in range(1,tou):
    y = tou - x
    if(((2 * x) + (4 * y)) == jiao):
        print("鸡有" + str(x) +"只，兔有"+ str(y) +"只")


# # -----------------------T3-----------------------------
# print("--------------------------倒序显示---------------------------")
# data = input("请输入1个数：")
# print("输入的数是：", data)  
# print("------------------------" + data + "倒序为---------------------------")   
# print(data[::-1])                